# DigitGroupingAmount Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Units..::..DigitGroupingAmount Property
Units Class See Also
---
The number of digits in each group when numbers are formatted with digit grouping.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public DigitGroupingAmount DigitGroupingAmount { get; set; }
```

Visual Basic
---
```text
Public Property DigitGroupingAmount As DigitGroupingAmount
	Get
	Set
```

Visual C++
---
```text
public:
property DigitGroupingAmount DigitGroupingAmount {
	DigitGroupingAmount get ();
	void set (DigitGroupingAmount value);
}
```

# ### Field Value
The number of digits in each group. The default is Three.
# Remarks
This setting only has an effect when the UseDigitGrouping property is set to true in the FormatOptions object for the unit type being formatted.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
Units Class
Autodesk.Revit.DB Namespace